# Amazon recommendation dataset

<br>

<i> thanks to https://www.kaggle.com/qwikfix/amazon-recommendation-dataset/comments </i>

In [22]:
import numpy as np
import pandas as pd

In [35]:
data = pd.read_csv("Reviews.csv")

In [5]:
data.head()

,Id,ProductId,UserId,ProfileName,HelpfulnessNumerator,HelpfulnessDenominator,Score,Time,Summary,Text
0,1,B001E4KFG0,A3SGXH7AUHU8GW,delmartian,1,1,5,1303862400,Good Quality Dog Food,I have bought several of the Vitality canned d...
1,2,B00813GRG4,A1D87F6ZCVE5NK,dll pa,0,0,1,1346976000,Not as Advertised,Product arrived labeled as Jumbo Salted Peanut...
2,3,B000LQOCH0,ABXLMWJIXXAIN,"Natalia Corres ""Natalia Corres""",1,1,4,1219017600,"""Delight"" says it all",This is a confection that has been around a fe...
3,4,B000UA0QIQ,A395BORC6FGVXV,Karl,3,3,2,1307923200,Cough Medicine,If you are looking for the secret ingredient i...
4,5,B006K2ZZ7K,A1UQRSCLF8GW1T,"Michael D. Bigham ""M. Wassir""",0,0,5,1350777600,Great taffy,Great taffy at a great price. There was a wid...

In [70]:
reviews = data.drop(["ProfileName","Summary","Text","Id","HelpfulnessNumerator","HelpfulnessDenominator","Time","Score"], axis=1)
reviews.head()

    ProductId          UserId
0  B001E4KFG0  A3SGXH7AUHU8GW
1  B00813GRG4  A1D87F6ZCVE5NK
2  B000LQOCH0   ABXLMWJIXXAIN
3  B000UA0QIQ  A395BORC6FGVXV
4  B006K2ZZ7K  A1UQRSCLF8GW1T

In [71]:
reviews.shape

(568454, 2)

In [72]:
reviews['ProductId'].nunique()

74258

In [73]:
reviews['UserId'].nunique()

256059

In [74]:
dayofweek = pd.to_datetime(data['Time'], unit='s').dt.dayofweek
quarter = pd.to_datetime(data['Time'], unit='s').dt.quarter

reviews['DayOfWeek'] = dayofweek
reviews['Quarter'] = quarter
reviews['Score'] = data["Score"]

reviews.head(5)

    ProductId          UserId  DayOfWeek  Quarter  Score
0  B001E4KFG0  A3SGXH7AUHU8GW          2        2      5
1  B00813GRG4  A1D87F6ZCVE5NK          4        3      1
2  B000LQOCH0   ABXLMWJIXXAIN          0        3      4
3  B000UA0QIQ  A395BORC6FGVXV          0        2      2
4  B006K2ZZ7K  A1UQRSCLF8GW1T          6        4      5

<br>


_to numeric ids_

In [83]:
reviews.drop(["UserId"], axis=1)
reviews["UserId"] = numeric_id
reviews

         ProductId  UserId  DayOfWeek  Quarter  Score
0       B001E4KFG0       0          2        2      5
1       B00813GRG4       1          4        3      1
2       B000LQOCH0  468953          0        3      4
3       B000UA0QIQ  544172          0        2      2
4       B006K2ZZ7K  483942          6        4      5
...            ...     ...        ...      ...    ...
568449  B001EO7N10  568449          2        1      5
568450  B003S1WTCU  568450          4        1      2
568451  B004I613EE  568451          1        1      5
568452  B004I613EE  568452          1        1      5
568453  B001LR2CU2  568453          3        2      5

[568454 rows x 5 columns]

In [93]:
reviews.drop(["ProductId"], axis=1)
reviews["ProductId"] = numeric_id_products
reviews

        ProductId  UserId  DayOfWeek  Quarter  Score
0               0       0          2        2      5
1               1       1          4        3      1
2               2  468953          0        3      4
3               3  544172          0        2      2
4               4  483942          6        4      5
...           ...     ...        ...      ...    ...
568449      74254  568449          2        1      5
568450      74255  568450          4        1      2
568451      74256  568451          1        1      5
568452      74256  568452          1        1      5
568453      74257  568453          3        2      5

[568454 rows x 5 columns]

In [95]:
amazon = pd.DataFrame()

amazon["UserId"] = reviews["UserId"]
amazon["ProductId"] = reviews["ProductId"]
amazon["DayOfWeek"] = reviews["DayOfWeek"]
amazon["Quarter"] = reviews["Quarter"]
amazon["Score"] = reviews["Score"]

amazon

        UserId  ProductId  DayOfWeek  Quarter  Score
0            0          0          2        2      5
1            1          1          4        3      1
2       468953          2          0        3      4
3       544172          3          0        2      2
4       483942          4          6        4      5
...        ...        ...        ...      ...    ...
568449  568449      74254          2        1      5
568450  568450      74255          4        1      2
568451  568451      74256          1        1      5
568452  568452      74256          1        1      5
568453  568453      74257          3        2      5

[568454 rows x 5 columns]

In [105]:
amazon['DayOfWeek'] = amazon['DayOfWeek'].replace(0, 7)
amazon

        UserId  ProductId  DayOfWeek  Quarter  Score
0            0          0          2        2      5
1            1          1          4        3      1
2       468953          2          7        3      4
3       544172          3          7        2      2
4       483942          4          6        4      5
...        ...        ...        ...      ...    ...
568449  568449      74254          2        1      5
568450  568450      74255          4        1      2
568451  568451      74256          1        1      5
568452  568452      74256          1        1      5
568453  568453      74257          3        2      5

[568454 rows x 5 columns]

In [106]:
from sklearn.model_selection import train_test_split

X_train, X_test, y_train, y_test = train_test_split(amazon[amazon.columns[:-1]], amazon["Score"], test_size=0.4, random_state=42)

In [ ]:
X_train["Score"] = y_train.values
X_test["Score"] = y_test.values

In [114]:
X_test.to_csv("amazon_test_o.txt", sep=",", header=None, index=False)
X_train.to_csv("amazon_train_o.txt", sep=",", header=None, index=False)

<br><br>

##### string id -> numeric id

In [36]:
users = pd.DataFrame()

users['user_id'] = data["UserId"]

In [ ]:
numeric_id = [None] * users["user_id"].shape[0]
index = 0

for i in range(users.shape[0]):
    
    # already assigned
    if numeric_ids[i] != None:
        continue
        
    index_list = users.index[users["user_id"] == users.loc[i].values[0]].tolist()
    
    # not yet assigned and only one
    if len(index_list) == 1:
        numeric_id[i] = index
        index = index + 1
        continue
        
        
    # not yet assigned, but not only one, that means it is first one - assigne all
    for j in range(len(index_list)):
        numeric_id[index_list[j]] = index
    
    index = index + 1

numeric_id

In [61]:
users["nusers_id"] = numeric_id
users

               user_id  nusers_id
0       A3SGXH7AUHU8GW          0
1       A1D87F6ZCVE5NK          1
2        ABXLMWJIXXAIN     468953
3       A395BORC6FGVXV     544172
4       A1UQRSCLF8GW1T     483942
...                ...        ...
568449  A28KG5XORO54AY     568449
568450  A3I8AFVPEE8KI5     568450
568451  A121AA1GQV751Z     568451
568452   A3IBEVCTXKNOH     568452
568453  A3LGQPJCZVL9UC     568453

[568454 rows x 2 columns]

In [64]:
users["user_id"].nunique()

256059

In [66]:
users["nusers_id"].nunique()

256059

<br><br>

In [ ]:
products = pd.DataFrame()

products['ProductId'] = data["ProductId"]

In [ ]:
numeric_id_products = [None] * products["ProductId"].shape[0]
index = 0

for i in range(products.shape[0]):
    
    if( i % 1000 == 0 ):
        print(i)
        
        
    # already assigned
    if numeric_id_products[i] != None:
        continue
        
    index_list = products.index[products["ProductId"] == products.loc[i].values[0]].tolist()
    
    # not yet assigned and only one
    if len(index_list) == 1:
        numeric_id_products[i] = index
        index = index + 1
        continue
        
        
    # not yet assigned, but not only one, that means it is first one - assigne all
    for j in range(len(index_list)):
        numeric_id_products[index_list[j]] = index
    
    index = index + 1

numeric_id_products

In [89]:
products['nProductId'] = numeric_id_products

products

         ProductId  nProductId
0       B001E4KFG0           0
1       B00813GRG4           1
2       B000LQOCH0           2
3       B000UA0QIQ           3
4       B006K2ZZ7K           4
...            ...         ...
568449  B001EO7N10       74254
568450  B003S1WTCU       74255
568451  B004I613EE       74256
568452  B004I613EE       74256
568453  B001LR2CU2       74257

[568454 rows x 2 columns]

In [91]:
products['nProductId'].nunique()

74258